export const messageMap = new Map<
  string,
  { message: string; author: '京花' | '厚芳' | '厚芳&京花' }
>([
  // 厚芳のコメント
  [
    'WatanabeKenta',
    {
      message:
        'お互いがボケ担当なので、会話するとツッコミの必要性をとても感じます\nどこから生まれるのかわからない、独特で天才的なボケセンスは見習っていきたいです\n今後も多くの人に笑顔を届けつつ、深夜帰宅しないよう体調にお気をつけください',
      author: '厚芳',
    },
  ],
  [
    'MakiRyota',
    {
      message:
        '卒業後に交流が増えた珍しい友達で、遊ぶに連れてめっちゃ面白い人と感じました\n今日は高校時代のふりかけ文通相手に初めて会える記念の日ですね\nたぶんLINEとか聞いたら快く交換してくれると思います、がんばってください',
      author: '厚芳',
    },
  ],
  [
    'KushibikiMasaya',
    {
      message:
        '仲の良かったくっしーが途中から同じ部活に入ってくれて嬉しかったです\nなぜか詳しくない某漫画のファイルを誕生日にプレゼントいただきありがとうございました\n未だに大切にしっかりと保管してあります',
      author: '厚芳',
    },
  ],
  [
    'OsakiShoichiro',
    {
      message:
        '部活では何も悪くない大崎くんまで何故か怒られるなど、迷惑をかけすみませんでした\n道路の中央にて女バドに見られながらもキメた勇姿がいまだに忘れられません\n今日も思い出のあのポーズで写真を撮りませんか',
      author: '厚芳',
    },
  ],
  [
    'KomuraKento',
    {
      message:
        'こむけんはYouTubeを始めようと思うきっかけをくれた恩人です\n仕事や人生に対しての考え方が、少し似ているように感じています\n意外と全然直接遊んでない気がするので、またイケボを聞かせてください',
      author: '厚芳',
    },
  ],
  [
    'NakamuraYusuke',
    {
      message:
        '卒業してからも遊んでいて、明和生の中で一番交流が深い友達だと思っています\n高校時代はプリントの整理などお世話をされてましたが、ようやく独り立ちできました\n生活力の面で心配かと思いますが、温かく見守っていてください',
      author: '厚芳',
    },
  ],
  [
    'MiyahiraKyosuke',
    {
      message:
        '今まであった全ての人の中で一番純粋な人だと思っています\n目標が高く努力家、他人への悪意が無いなど、尊敬できるところをいくつも持っています\nもし都合が合えば、いつか北海道以来の大きめの旅行を3人で行きましょう',
      author: '厚芳',
    },
  ],
  [
    'UchidaKeigo',
    {
      message:
        '僕が東大に入ってから正真正銘初めて交流した友達でした\nうっちーが話しかけてくれたお陰で孤立せずに済んだと、かなり感謝しています\n北海道以来3人で大きな旅行行っていないので、今度四国とか行きましょう',
      author: '厚芳',
    },
  ],
  [
    'TakataRyuhei',
    {
      message:
        '数少ない、ガチャの結果報告などができるゲーム友達です\n場をまとめる謎のカリスマ性があり、自分にないものをいくつも持っている人だと感じます\nよく名前を間違えられるので、お互い自身をアピールしていきましょう',
      author: '厚芳',
    },
  ],
  [
    'ShimizuYuho',
    {
      message:
        'テニス&研究で高い結果を出し、真の文武両道を実現していて尊敬しています\n相手を否定せずかつ純粋に自分の気持ちを表現しているように感じ、話してて楽しいです\n運動不足が酷いので、是非定期的にゆるくテニスしましょう',
      author: '厚芳',
    },
  ],

  [
    'IshikawaYatsuho',
    {
      message:
        '奇愛に入って初めて会話した同期で、渾名が呼びやすい者同士縁を感じました\n大学一年の時から、なんやかんやで一番遊んでいる友達です\nカナダに行っても是非カードバトラー魂を忘れないでください',
      author: '厚芳',
    },
  ],
  [
    'AkibaMiyuki',
    {
      message:
        '奇愛の中の常識人という”なぜか”レアな立ち位置で、カオスな奇愛の良心でした\nあきばっちがいるとイベントが華やかになり雰囲気が明るくなります\n仕事が忙しいと思いますが、定期的にイベントに誘うので空いてたら来てください',
      author: '厚芳',
    },
  ],
  [
    'TakizawaRyutaro',
    {
      message:
        'たっきーがいるだけでゆるい雰囲気で場が盛り上がるので、必ず遊びに誘ってしまってます\n数少ないエンジニア友達で、興味のあることすべて挑戦する姿勢をとても尊敬しています\nもしGAFAに入社しても僕のことを忘れないでください',
      author: '厚芳',
    },
  ],
  [
    'ChoKahin',
    {
      message:
        '大学ネタで霞みがちですが、コミュ力・語学・マジックなど才能が溢れてると思います\n遊びの際もカヒンの盛り上げ力を頼りに毎回誘わせていただいています\n(PS 会うたびに質量が変化してる気がしますが気のせいでしょうか)',
      author: '厚芳',
    },
  ],
  [
    'IsobeEchika',
    {
      message:
        'マカロンのようなガーリーなポップさとポテトのような親近感を合わせた人だと思っています\n男女問わずどんな人でも仲良くなれるコミュ力がとても羨ましいです\n今後も円安に負けず、ポテト割安キャンペーンの情報を共有しましょう',
      author: '厚芳',
    },
  ],
  [
    'IshikawaMinami',
    {
      message:
        'みなみちゃんは最初にあったときから、やっほーとの熟年夫婦間があり仲が良いんだと感じました。\n来月の式楽しみにしてます厚芳より\n東京に来てからできた唯一の友達だよ！似たようなゆるい旦那を持った者同士これからも仲良くしようね！',
      author: '京花',
    },
  ],

  // 京花
  [
    'ItoYuri',
    {
      message:
        'ハタチマッチの時に、ふなきょうカップルと名付けてくれて、推してくれてありがとう！\n絵が上手で、インスタにたまにあがっているのをみて感動しています！\n私とふなっしーの絵も描いてもらおうかな？笑\n優里ちゃんの撮る写真も好きなので\n今度カメラ教えてください！',
      author: '京花',
    },
  ],
  [
    'ShimizuMai',
    {
      message:
        '卒業してからもカフェに行ったり、女子旅したね！\nまいちゃんの写真が一番多い！笑\nまいちゃんは気軽にお話しできて、テンションが合うから、\nすごく癒されます！\nこれからも旅行、カフェたくさん行って、インスタ映えの写真を\nいっぱい撮ろうね〜♪',
      author: '京花',
    },
  ],

  [
    'YamadaYuka',
    {
      message:
        '由佳ちゃんといると、お互いにいつも何かをやらかすので、一緒にいて楽しいです笑\n卒業してからも旅行たくさん行ったね！ちょっと東京に用事があるたびに会いにきてくれてありがとう！\nお医者さん大変だと思うけど、無理しないでね！\nおばあちゃんになっても\n仲良くしてね♡',
      author: '京花',
    },
  ],

  [
    'HattoriWakana',
    {
      message:
        'わかなちゃんがくれるインスタの\nコメントやLINE、ユーモアが\nあって大好きです！\nサプライズで結婚のお祝いケーキとプレゼント用意してくれてすごく\n嬉しかった！\nハンドクリーム大事に使ってるよ！　またご飯とか食べに行こうね！',
      author: '京花',
    },
  ],
  [
    'AndoShizuka',
    {
      message:
        'しいちゃんは自分の考えをしっかり持っていて、それを言葉にできて\nすごいなぁと思っているよ！\n大学生の時にぴーよとホテルで久しぶりに遊んだ時、金髪でびっくりしたけど、かっこよかった！\nお互い関東に住んでいるので、またタイミング合わせて\n遊びに行きましょう〜！',
      author: '京花',
    },
  ],
  [
    'HayakawaChiho',
    {
      message:
        '高校1年生の時、席が前後だった縁から同じ部活にも入って、一緒にいてくれてありがとう！\n「学生時代に出会った人と結婚する人は3割いて、私たちも、もしかしたらもう出会ってるかもね〜！」と話してたのが懐かしい！覚えてる？\nいつでも会いたいので東京寄ったら連絡してね♪',
      author: '京花',
    },
  ],
  [
    'OhashiAoi',
    {
      message:
        '書道部と茶華道部の兼部仲間だったね！\nぴーよがいると、場が和むので、勝手に安心感を感じているよ！\nテレビに映るお仕事は深夜に呼び出されたり、大変だと思うけど、その仕事を選んで頑張っているぴーよを尊敬してるよ！',
      author: '京花',
    },
  ],
  [
    'IkedaSayane',
    {
      message:
        '穏やかでほんわかしている、さやねちゃんがいると、場が和んで安心感があるよ！\n結婚式の招待状のコメントに推しカップルと書いてくれてありがとう！\nこれからも推してもらえるように、仲良し夫婦でいます！',
      author: '京花',
    },
  ],
  [
    'OshikaAyako',
    {
      message:
        '綾子ちゃんは効率が良くて、行動力がすごくて、一緒にいると\nすごく楽しい！\n綾子ちゃんがいたから、研究室メンとの思い出がたくさんできて、\n楽しかった！\nみんなばらばらになってしまったけど、またご飯とか旅行に行こうね！',
      author: '京花',
    },
  ],
  [
    'WatanabeNao',
    {
      message:
        '菜緒ちゃんとは、高校の時から出会ってたよね！自習室の前の席でいつも頑張ってる子がいるな〜と思って私も頑張れたよ！\n菜緒ちゃんは気配りができて後輩からも慕われていて尊敬しているよ！\n高知県は遠いけど、お互い愛知に帰ってきた時にぜひまた遊ぼうね！',
      author: '京花',
    },
  ],
  [
    'OtakeYukiko',
    {
      message:
        'ゆっきーは、穏やかでほんわかしていて、いつも癒されているよ！\nゆっきーと推しが一緒で嬉しい！\nまたドラマの話と推しの話いっぱいしようね！\n受付も引き受けてくれてありがとう\n(P.S.お礼のリップはみっちー愛用リップだよ笑)',
      author: '京花',
    },
  ],

  [
    'YagiMomoka',
    {
      message:
        'ももちゃんはすごく明るくて面白くて、話しやすいオーラがあって、\n癒されます！\nいつも可愛いと言ってくれてありがとう！今日もたくさん言ってくれることを期待してるよ！笑\n受付も引き受けてくれてありがとう\n披露宴はぜひ目一杯楽しんでね〜♪',
      author: '京花',
    },
  ],
  [
    'NozakiRisa',
    {
      message:
        '大学1年生の時から、ずっと一緒にいたね！大学時代を思い返すと\nりっちょばかりだよ！\n一緒にご飯食べたり、勉強したり、たくさんおしゃべりしたね！\nりっちょのおかげで大学生活\n楽しめたよ！\n今日は大切な日に来てくれて\nありがとう！\nぜひ最後まで楽しんでいってね♪',
      author: '京花',
    },
  ],
  [
    'NishimuraAkari',
    {
      message:
        '同じ蟹江町民で、スギ薬局でバイトをしていた仲間だったね！\nすごく親近感があったよ！\n明莉ちゃんは、すごく頼りになるし知らない人でも誰とでも話せるコミュ力をもっていて尊敬してるよ！\nあかりちゃんの今後の活躍を\n期待しているよ〜！\n今日は楽しんでいってね〜♪',
      author: '京花',
    },
  ],
  [
    'NakashimaMoe',
    {
      message:
        'いつもポジティブで誰からも愛されるもえはいつまでも自慢の妹だよ！\n小さい頃はよく私の携帯で自撮り\n動画を撮っていて、面白かったな笑\n表情豊かなもえをこれからも\nたくさん見せてね！\n今日は一生の思い出作りを\n手伝ってね！',
      author: '京花',
    },
  ],
  [
    'NakashimaNorihiko',
    {
      message:
        '小さい頃から、公園で遊んだり、\nカードゲームしたり、いろんな事を一緒にやったね！もうお互いに大人な年齢なのがびっくりだね！\nのりがいると一気に家庭が賑やかになるよね！笑\nのりの漫才いつかみたいなーー！笑今日は萌と3人で中座よろしくね！\n思い出を残そう！',
      author: '京花',
    },
  ],
]);
